; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob68) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - pallet
	crate0 crate1 crate2 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate0)
	(at pallet6 distributor1)
	(clear pallet6)
	(at pallet7 distributor0)
	(clear pallet7)
	(at pallet8 depot2)
	(clear crate1)
	(at pallet9 depot1)
	(clear pallet9)
	(at pallet10 depot2)
	(clear crate2)
	(at pallet11 depot2)
	(clear pallet11)
	(at truck0 depot2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 452)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 317)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at hoist10 depot1)
	(available hoist10)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(= (weight crate0) 81)
	(at crate1 depot2)
	(on crate1 pallet8)
	(= (weight crate1) 17)
	(at crate2 depot2)
	(on crate2 pallet10)
	(= (weight crate2) 62)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet9)
		(on crate1 pallet10)
		(on crate2 pallet3)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet5)
   added: (lifting hoist5 crate0) (clear pallet5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 3
2. (lift hoist2 crate2 pallet10 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet10)
   added: (lifting hoist2 crate2) (clear pallet10)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 3
3. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 62
   goals met: 0 of 3
4. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 3
5. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   changed: (current_load truck0) from 62 to 143
   goals met: 0 of 3
6. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 3
7. (unload hoist1 crate0 truck0 depot1)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 143 to 62
   goals met: 0 of 3
8. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 22 to 32
   goals met: 0 of 3
9. (lift hoist2 crate1 pallet8 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet8)
   added: (lifting hoist2 crate1) (clear pallet8)
   changed: (fuel-cost) from 32 to 33
   goals met: 0 of 3
10. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   changed: (current_load truck0) from 62 to 0
   goals met: 0 of 3
11. (drop hoist1 crate0 pallet9 depot1)
   deleted: (lifting hoist1 crate0) (clear pallet9)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 pallet9)
   goals met: 1 of 3
12. (drop hoist2 crate1 pallet10 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet10)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet10)
   goals met: 2 of 3
13. (drop hoist3 crate2 pallet3 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet3)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 pallet3)
   goals met: 3 of 3
